
Функция ПолучитьТекстЗапросаПоСравнению() экспорт

	Возврат "ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(т.Документ КАК Документ.ОтгрузкаТоваровУслуг) КАК ДокументОтгрузки,
	        |	ВЫРАЗИТЬ(т.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницыКонтрагентов) КАК СтруктурнаяЕдиница,
	        |	т.ДатаОтгрузки,
	        |	ВЫРАЗИТЬ(т.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	        |	ВЫРАЗИТЬ(т.Количество КАК ЧИСЛО(15, 2)) КАК Количество,
	        |	ВЫРАЗИТЬ(т.Цена КАК ЧИСЛО(15, 4)) КАК Цена
	        |ПОМЕСТИТЬ втТовары
	        |ИЗ
	        |	&ТаблицаДанных КАК т
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	т1.ДокументОтгрузки КАК ДокументОтгрузки,
	        |	т1.СтруктурнаяЕдиница,
	        |	т1.ДатаОтгрузки КАК ДатаОтгрузки,
	        |	т1.Номенклатура КАК Номенклатура,
	        |	СУММА(т1.Количество) КАК КоличествоПлан,
	        |	СУММА(ЕСТЬNULL(т2.Количество, 0) * ЕСТЬNULL(т2.Коэффициент, 0)) КАК КоличествоФакт,
	        |	т1.Цена КАК ЦенаПлан,
	        |	ЕСТЬNULL(т2.Цена, 0) КАК ЦенаФакт,
			|   ИСТИНА КАК РазрешенВывод 
	        |ИЗ
	        |	втТовары КАК т1
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровУслуг.Товары КАК т2
	        |		ПО т1.ДокументОтгрузки = т2.Ссылка
	        |			И т1.Номенклатура = т2.Номенклатура
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	т1.ДокументОтгрузки,
	        |	т1.СтруктурнаяЕдиница,
	        |	т1.ДатаОтгрузки,
	        |	т1.Номенклатура,
	        |	т1.Цена,
	        |	т2.Цена
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаОтгрузки,
	        |	ДокументОтгрузки,
	        |	Номенклатура";	
КонецФункции // ПолучитьТекстЗапросаПоТоварам()
		
Функция ПолучитьТаблицуДанных() экспорт

	Запрос = Новый Запрос(ПолучитьТекстЗапросаПоСравнению());	
	Запрос.УстановитьПараметр("ТаблицаДанных", Товары.Выгрузить()); 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;

КонецФункции 


 